Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བ་དེ་ཕ་དང་མས་གནང་ནས། སེམས་ཅན་བཙོན་ར་བ་དེ་དག་ཡོངས་སུ་བཀྲོལ་བའི་འོག་ཏུ་སྲིད་ཤིན་ཏུ་བདེ་བ་དང་། ནོར་དང་དབྱིག་རིན་པོ་ཆེ་ཕུན་སུམ་ཚོགས་པ་དག་ཀྱང་བོར། བུ་དང་ཆུང་མ་དག་ཀྱང་སྤངས་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མའི་རྒྱལ་པོའི་ཞམ་རིང་དུ་རབ་ཏུ་བྱུང་ངོ་། །
en: “Noble one, Prince Vijitāvin’s father and mother gave him permission, so that after he freed those beings from prison, he cast aside the pleasure of existence, the good fortune of wealth and precious treasuries, abandoned children and wives, and entered mendicancy under the Bhagavat, the Tathāgata Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja.

source: རབ་ཏུ་བྱུང་ནས་ཀྱང་ལོ་སྟོང་ཕྲག་ལྔར་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ། དེའི་བར་སྐབས་སུ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་སྟོང་ཕྲག་བཅུ་ཡོངས་སུ་བསྒྲུབས་སོ། །གཟུངས་ཀྱི་སྒོ་སྟོང་ཕྲག་བཅུ་ཡང་རབ་ཏུ་ཐོབ་པོ། །མངོན་པར་ཤེས་པའི་ཚུལ་སྟོང་ཕྲག་བཅུ་ལའང་རབ་ཏུ་ཞུགས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་གཏེར་སྟོང་ཕྲག་བཅུའང་རབ་ཏུ་ཐོབ་བོ། །ཐམས་ཅད་མཁྱེན་པའི་ཤུགས་སྟོང་ཕྲག་བཅུའང་ཡོངས་སུ་སྐྱེས་སོ། །
en: After entering mendicancy he maintained celibacy for five thousand years.

source: བཟོད་པའི་སྒོ་སྟོང་ཕྲག་བཅུ་ཡང་ཡོངས་སུ་སྦྱངས་སོ། །སེམས་ངེས་པར་བཞག་པ་སྟོང་ཕྲག་བཅུ་ཡང་མངོན་པར་བསྒྲུབས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་ཀྱི་ལུས་སྟོང་ཕྲག་བཅུ་ཡང་ཡོངས་སུ་སྤེལ་ཏོ། །བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་སྒོ་སྟོང་ཕྲག་བཅུར་ཡང་རབ་ཏུ་ཞུགས་སོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་སྟོང་ཕྲག་བཅུ་ཡང་ཡོངས་སུ་སྐྱེས་སོ། །སངས་རྒྱས་བལྟ་བའི་ཕྱོགས་ཀྱི་སྒོ་སྟོང་ཕྲག་བཅུ་ཡང་མངོན་དུ་གྱུར་ཏོ། །
en: “During that time he accomplished ten thousand gateways into samādhi, he attained ten thousand gateways into the power of mental retention, he entered ten thousand ways of higher cognition, he attained ten thousand bodhisattva treasures, he developed ten thousand powers of omniscience, he purified ten thousand gateways into patience, he accomplished ten thousand realizations through contemplation, he multiplied ten thousand bodies with the strengths of a bodhisattva, he entered ten thousand gateways into the knowledge of a bodhisattva, he developed ten thousand ways of the perfection of wisdom, he perceived ten thousand gateways for looking at the buddhas in the directions, and he accomplished ten thousand bodhisattva prayers.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་སྟོང་ཕྲག་བཅུ་ཡང་མངོན་པར་བསྒྲུབས་སོ། །དེ་དེ་ལྟ་བུའི་ཆོས་དང་ལྡན་པས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཕྱོགས་བཅུར་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུ་ཡོངས་སུ་གནོན་ཏོ། །
en: “Possessing such qualities in each instant of mind, he could arrive in ten thousand buddha realms.

source: འཇིག་རྟེན་གྱི་ཁམས་རེ་རེ་ཞིང་ཡང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་སངས་རྒྱས་སྟོང་ཕྲག་བཅུ་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་རྗེས་སུ་དྲན་ནོ། །
en: In each world realm, in each instant of mind, he could remember ten thousand past and future buddhas.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སངས་རྒྱས་ཀྱི་སྤྲུལ་པ་རྒྱ་མཚོ་སྟོང་ཕྲག་བཅུ་ཕྱོགས་བཅུར་གཤེགས་པ་དེ་དག་ཀྱང་མཐོང་ཞིང་ཤེས་སོ། །
en: He could see and know ten thousand oceans of emanations from each of those buddhas going into the ten directions.

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུར་གཏོགས་པའི་སེམས་ཅན་འགྲོ་བའི་རྒྱུད་སྣ་ཚོགས་སུ་སྐྱེས་པ་ཤི་འཕོ་ཞིང་སྐྱེ་བར་འགྱུར་བ་མཐོ་བ་དང་། དམའ་བ་དང་།
en: “In each instant of mind, he could see all the beings within those ten thousand buddha realms.

source: བདེ་འགྲོའི་ལམ་དུ་ཕྱིན་པ་དང་། ངན་སོང་གི་ལམ་དུ་ཕྱིན་པ་དང་། ཁ་དོག་སྡུག་པ་དང་། ཁ་དོག་མྱི་སྡུག་པ་ལས་ཇི་བཞིན་དུ་སྐྱེས་པར་གྱུར་པ་ཐམས་ཅད་ཀྱང་མཐོང་བར་གྱུར་ཏོ། །སེམས་ཅན་དེ་དག་གི་ཤི་འཕོ་དང་སྐྱེ་བ་ཡང་ཁོང་དུ་ཆུད་ཅིང་མཐོང་སྟེ། སེམས་ཀྱི་རྒྱུད་དང་།
en: He knew their birth into various existences, their passing away and their rebirths, their decline, their ascent, their going on the path to happy existences, their going on the path to lower existences, their having a beautiful color, and their having a bad color, exactly as they were born.

source: སེམས་ཀྱི་སྤྱོད་པ་དང་། སེམས་ཀྱི་འདབ་འབྲེལ་བ་དང་། བསམ་པ་སྣ་ཚོགས་དང་། དབང་པོ་རྒྱ་མཚོ་དང་། སྦྱོར་བ་འབྱམ་ཀླས་པ་དང་།
en: “He saw the passing away and the rebirth of all those beings, and he saw and knew their movements of mind, the conduct of their minds, the continuation of their minds, their various thoughts, their ocean of faculties, the vast extent of their activities, the conclusion of their karma, and the times for ripening and guiding them.

source: ལས་མཐར་ཐུག་པ་དང་། ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། རྣམ་པར་གདུལ་བའི་དུས་ཀྱང་ཁོང་དུ་ཆུད་ཅིང་མཐོང་ངོ་། །རིགས་ཀྱི་བུ་རྒྱལ་པོ་གཞོན་ནུ་དེ་དེ་ནས་ཤི་འཕོས་ནས་ཀྱང་འཛམ་བུའི་གླིང་དེ་ཉིད་དུ་རྒྱལ་པོའི་གནས་དགའ་བ་དང་ལྡན་པར་རྒྱལ་པོ་དེ་ཉིད་ཀྱི་རིགས་སུ་སྐྱེས་ནས། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ཐོབ་པར་གྱུར་ཏོ། །
en: “Noble one, when that prince passed away, he was reborn in the family of that king in the royal capital, Rativyūhā, in that Jambudvīpa, and he succeeded to the sovereignty of a cakravartin king.

source: དེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་པས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་ནམ་མཁའི་སྤྲིན་གྱི་སྒྲོན་མའི་རྒྱལ་པོ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་ནམ་མཁའ་ལ་དཔལ་ཤིན་ཏུ་འཕགས་པའི་རྒྱལ་པོ་བསྙེན་བཀུར་ཏོ། །
en: When he had become a cakravartin king, following the parinirvāṇa of the Bhagavat, the Tathāgata Dharma­cakra­nirghoṣa­gagana­megha­pradīpa­rāja, he honored the Tathāgata by the name of Dharma­gaganābhyudgata­śrī­rāja.

source: དེའི་འོག་ཏུ་སྙིང་པོ་བྱང་ཆུབ་དེ་ཉིད་དུ་བརྒྱ་བྱིན་དུ་གྱུར་ཏེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་དབང་སྙིང་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “After that, he became a Śakra who at the bodhimaṇḍa honored the Tathāgata by the name of Devendragarbha.

source: དེའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་རབ་མཚེ་མའི་ལྷའི་རྒྱལ་པོར་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་སའི་དཔལ་རི་བོའི་གཟི་བརྗིད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “After that, in that world realm he became a Suyāma king of devas who honored the Tathāgata by the name of Dharaṇī­śrī­parvata­tejas.

source: དེའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་རབ་དགའ་ལྡན་གྱི་ལྷའི་རྒྱལ་པོར་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོའི་འོད་རབ་ཏུ་བསྒྲགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “After that, in that world realm he became a Saṃtuṣita king of devas who honored the Tathāgata by the name of Dharma­cakra­prabha­nirghoṣa­rāja.

source: དེའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་རབ་འཕྲུལ་དགའི་ལྷའི་རྒྱལ་པོར་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་ནམ་མཁའ་མཛེས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “After that, in that world realm he became a Sunirmita king of devas who honored the Tathāgata by the name of Gagana­kānta­rāja.

source: དེའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་དབང་བསྒྱུར་གྱི་ལྷའི་རྒྱལ་པོར་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་སྟོབས་ལ་ཐུབ་པ་མྱེད་པའི་དཔལ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “After that, in that world realm he became a Vaśavartin king of devas who honored the Tathāgata by the name of Anavamarda­bala­ketu.

source: དེའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་ལྷ་མ་ཡིན་གྱི་དབང་བོར་གྱུར་ཏེ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཐམས་ཅད་ཀྱི་འབྲུག་སྒྲ་བསྒྲགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “After that, in that world realm he became an asura lord who honored the Tathāgata by the name of Sarva­dharma­nigarjita­rāja.

source: དེའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་ཚངས་པའི་དབང་པོར་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོ་སྤྲུལ་པ་ཀུན་ཏུ་སྣང་བའི་དབྱངས་ཤེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “After that, in that world realm he became a Brahmā lord who honored the Tathāgata by the name of Dharma­cakra­nirmāṇa­samanta­pratibhāsa­nirghoṣa.

source: རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་འོད་དེ་ཉིད་དུ་བསྐལ་པ་འོད་བཟང་པོ་དེ་ཉིད་ལ་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་སྩོགས་པ། སངས་རྒྱས་སྟོང་ཕྲག་བཅུ་བྱུང་སྟེ།
en: “Noble one, there were those and the rest of the ten thousand buddhas who appeared in that world realm of Ratnaprabhā during the Suprabha kalpa.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རྒྱལ་པོ་གཞོན་ནུ་རྣམ་པར་རྒྱལ་བས་བསྙེན་བཀུར་ཏོ། །
en: Prince Vijitāvin honored all those tathāgatas.

source: རིགས་ཀྱི་བུ་བསྐལ་པ་འོད་བཟང་པོ་དེའི་འོག་ཏུ་བསྐལ་བ་འོད་གཟེར་བཟང་པོ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “Noble one, following that Suprabha kalpa arose the kalpa called Suraśmi.

source: བསྐལ་པ་འོད་གཟེར་བཟང་པོ་དེ་ལ་ཡང་སངས་རྒྱས་སྟོང་ཕྲག་བཅུ་བྱུང་ངོ་། །
en: During that Suraśmi kalpa there were ten thousand buddhas.

source: ཁོ་མོ་ཡང་བསྐལ་པ་དེ་ལ་རྒྱལ་པོ་བློ་གྲོས་ཆེན་པོ་ཞེས་བྱ་བ་ཞིག་ཏུ་གྱུར་ཏེ།
en: “In that kalpa, I became Mahāmati.

source: དེའི་ཚེ་ཁོ་མོ་རྒྱལ་པོར་གྱུར་བས་དེ་བཞིན་གཤེགས་པ་མཚན་གྱི་དཔལ་རི་བོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: During the time when I was King Mahāmati, I honored the Tathāgata by the name of Lakṣaṇa­śrī­parvata.

source: དེའི་འོག་ཏུ་བསྐལ་བ་དེ་ཉིད་ལ་ཁྱིམ་བདག་ཅིག་ཏུ་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་ཕུང་པོ་ཡོངས་སུ་གྲུབ་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Following that, in that same kalpa, I was a householder and I honored the Tathāgata by the name of Saṃvṛtaskandha.

source: དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་བློན་པོ་ཞིག་ཏུ་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དྲི་མ་མྱེད་པའི་སྲས་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Following that, in that same kalpa, I was a minister and I honored the Tathāgata by the name of Vimala­vatsa.

source: དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་ལྷ་མ་ཡིན་གྱི་དབང་པོ་ཞིག་ཏུ་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་ཤུགས་མངའ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Following that, in that same kalpa, I was an asura lord and I honored the Tathāgata by the name of Veśadhārin.

source: དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་ཤིང་གི་ལྷ་མོ་ཞིག་ཏུ་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་མཚན་ཉིད་རི་རབ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Following that, in that same kalpa, I was a tree goddess and I honored the Tathāgata by the name of Lakṣaṇa­sumeru.

source: དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་དེད་དཔོན་ཞིག་ཏུ་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་ཕྱག་དྲི་མ་མྱེད་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Following that, in that same kalpa, I was a caravan leader and I honored the Tathāgata by the name of Vimala­bāhu.

source: དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་གྲོང་ཁྱེར་གྱི་ལྷ་མོ་ཞིག་ཏུ་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་སེང་གེ་རྣམ་པར་གནོན་པས་བཞུད་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Following that, in that same kalpa, I was a city goddess and I honored the Tathāgata by the name of Siṃha­vikrānta­gāmin.

source: དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་ངལ་བསོ་བོ་ཞིག་ཏུ་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་ལྷ་དབང་གཙུག་ཕུད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Following that, in that same kalpa, I was a Vaiśravaṇa and I honored the Tathāgata by the name of Devendracūḍa.

source: དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་དྲི་ཟའི་རྒྱལ་པོ་ཞིག་ཏུ་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་གྲགས་པ་ཆོས་ཀྱིས་འཕགས་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Following that, in that same kalpa, I was a gandharva king and I honored the Tathāgata by the name of Dharmodgata­kīrti.

source: དེའི་འོག་ཏུ་བསྐལ་པ་དེ་ཉིད་ལ་གྲུལ་བུམ་གྱི་དབང་པོ་ཞིག་ཏུ་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་སྣང་བའི་ཅོད་པན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Following that, in that same kalpa, I was a kumbhāṇḍa lord and I honored the Tathāgata by the name of Avabhāsa­makuṭin.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་བཅུ་པོ་དེ་དག་ལ་སྩོགས་པ་བསྐལ་པ་འོད་གཟེར་བཟང་པོ་དེ་ལ་སྐྱེ་བའི་རིགས་སྣ་ཚོགས་སུ་སྐྱེས་ནས།
en: “Noble one, in that way, I honored those ten tathāgatas and all the others.

source: དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་བསྙེན་བཀུར་ཏེ། ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལ་མཆོད་པ་བྱས་སོ། །
en: I was reborn in various existences in the Suprabha kalpa and honored six hundred million tathāgatas and made offerings to all those tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་རེ་རེའི་སྤྱན་སྔར་འགྲོ་བའི་ཚེའང་སེམས་ཅན་གྱི་ཁམས་མཐའ་དང་དབུས་མྱེད་པ། བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨྱིན་པར་བྱས་སོ། །དེ་བཞིན་གཤེགས་པ་རེ་རེའི་སྤྱན་སྔར་འགྲོ་བའི་ཚེ་འང་ཏིང་ངེ་འཛིན་གྱི་སྒོ་སྣ་ཚོགས་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །གཟུངས་ཀྱི་སྒོ་སྣ་ཚོགས་དང་། མངོན་པར་བསྒྲུབ་པའི་ཚུལ་སྣ་ཚོགས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་མངོན་པར་བསྒྲུབ་པའི་ཚུལ་སྣ་ཚོགས་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚུལ་རྗེས་སུ་རྟོགས་པར་བྱ་བ་སྣ་ཚོགས་དང་།
en: Whenever I came before each of those tathāgatas, I ripened realms of beings without end or middle for the highest, complete enlightenment.

source: ཆོས་སྣང་བའི་སྒོ་ཐོབ་པར་བྱ་བའི་ཚུལ་སྣ་ཚོགས་དང་། ཡེ་ཤེས་ཀྱི་ཚུལ་ཁོང་དུ་ཆུད་པར་དཔྱད་པ་རྣམ་པ་སྣ་ཚོགས་དང་། ཕྱོགས་རྒྱ་མཚོ་ལ་འཇུག་པའི་སྣང་བ་སྣ་ཚོགས་དང་། ཞིང་རྒྱ་མཚོ་སྣ་ཚོགས་ལ་འཇུག་ཅིང་ཁོང་དུ་ཆུད་པར་བྱ་བའི་སྣང་བ་སྣ་ཚོགས་དང་། དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་མཐོང་བར་བྱ་བ་རྣམ་པར་དམྱིགས་པའི་སྣང་བ་སྣ་ཚོགས་ཀྱང་རབ་ཏུ་ཐོབ་བོ།
en: Whenever I came before each of those tathāgatas, I attained various entrances into samādhis, various entrances into powers of mental retention, various ways of accomplishments, various ways of accomplishing discernments, various realizations of the ways of omniscience, various ways of attaining the entrances to the illumination of the Dharma, various aspects of the analysis that comprehends the ways of knowledge, various illuminations of entering into the ocean of directions, and various illuminations of entering and comprehending the various oceans of realms, and I attained various illuminations of the perception that sees the ocean of tathāgatas.

source: ཡོངས་སུ་གནོན་ཏོ། །རྣམ་པར་དག་གོ །ཡོངས་སུ་རྫོགས་སོ། །ཡོངས་སུ་གནས་པར་གྱུར་ཏོ། །
en: I overcame them, purified them, perfected them, and remained in them.

source: སྐྱེས་སོ། །བྱུང་ངོ་། །རྣམ་པར་འཕེལ་ཏོ། །ཡོངས་སུ་འཕེལ་ཏོ། །རབ་ཏུ་བྱུང་ངོ་། །རྣམ་པར་བྱུང་ངོ་། །
en: They were born, they arose, they were increased, they were magnified, they arose perfectly, and they arose completely.

source: བསྐལ་བ་འོད་གཟེར་བཟང་པོ་དེ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཇི་ལྟར་རིམ་གྲོར་བྱས་པ་དེ་བཞིན་དུ་བསྐལ་པ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དུ། དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་བྱུང་བར་གྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་འཇིག་རྟེན་གྱི་ཁམས། གཞན་ནས་དེ་དག་ཏུ་བྱོན་ཏེ། ཆོས་བསྟན་པར་གྱུར་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་ཁོ་མོས་ཆོས་བསྟན་པ་ཐོས་ཏེ། ཐོས་ནས་ཀྱང་ཡོངས་སུ་བཟུང་ངོ་། །
en: “Just as I attended the tathāgatas in that Suprabha kalpa, during kalpas as numerous as the atoms in all the ocean of world realms, however many tathāgatas appeared, however many tathāgatas came from other world realms, from all those tathāgatas who taught the Dharma, I heard the Dharma that they taught, and having heard it, I possessed it.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། ཁོ་མོས་བསྙེན་བཀུར་ཏོ། །རིམ་གྲོར་བྱས་སོ། །
en: I honored all those tathāgatas and served them.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས། དེ་དག་གི་བསྟན་པ་ཡང་ཁོ་མོས་ཡོངས་སུ་བཟུང་ངོ་། །
en: I held the teaching of all those buddha bhagavats.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དགེ་བའི་རྩ་བ་ལ་ཡང་དག་པར་བསྐུལ་བ་འདི་ཐོབ་པར་བྱ་བའི་ཚུལ་སྣ་ཚོགས་དང་། རྣམ་པར་ཐར་པའི་ཚུལ་གྱི་སྒོ་སྣ་ཚོགས་ཀྱིས་ཐོབ་པར་གྱུར་ཏོ། །
en: I obtained from all those tathāgatas various ways for the attainment of this bodhisattva liberation called the origin of the roots of merit that inspire, in accordance with their dispositions, the ripening of all beings, and I obtained various entrances into ways of liberation.”

source: དེ་ནས་མཚན་མོའི་ལྷ་མོ་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་ཀྱིས། དེའི་ཚེ་རྣམ་པར་ཐར་པའི་ཚུལ་འདི་ཉིད་ཡོངས་སུ་བརྗོད་པ་དང་། ཡོངས་སུ་བསྟན་པའི་ཕྱིར་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། བསམ་གྱིས་མྱི་ཁྱབ་རྣམ་ཐར་དམ་པ་འདི། །
en: Then at that time, the night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā, in order to describe and teach this liberation, recited these verses to Sudhana, the head merchant’s son.

source: གྲགས་པ་ཁྱོད་ཀྱིས་བདག་ལ་གང་དྲིས་པ། །
en: “You, friend, have asked me about This inconceivable supreme liberation.

source: བདེ་བར་གཤེགས་པའི་བྱིན་གྱིས་དེ་བསྟན་ཀྱིས། །
en: I shall teach it through the blessing of the Sugata.

source: མ་ལུས་ཡང་དག་ཇི་བཞིན་བདག་ལས་ཉོན། །
en: Listen to me properly and entirely.

source: བསྐལ་པ་བསམ་ཡས་ཡངས་པ་མཐའ་ཡས་པ། །རྒྱ་མཚོའི་ཞིང་གི་རྡུལ་དང་གྲངས་མཉམ་པ། །དེ་ཀུན་འདས་པའི་སྔ་རོལ་མདངས་དགའ་བའི། །འཇིག་རྟེན་ཁམས་ཤིག་བྱུང་བ་རིན་ཆེན་འོད། །
en: {12} “There was the beautiful world realm Ratnaprabhā in the past beyond Inconceivable, vast, endless kalpas As numerous as the atoms in an ocean of buddha realms.

source: དེ་ཚེ་བསྐལ་པ་བཟང་པོའི་འོད་ཀྱང་བྱུང་། །དེ་ལ་རྒྱལ་བ་དཔག་ཏུ་མྱེད་པ་སྐྱེས། །
en: {13} “In that time, there arose the kalpa Suprabha In which countless jinas appeared.

source: ཐུབ་པའི་དབང་པོ་དེ་དག་ཁོ་མོ་ཡིས། །རྣམ་ཐར་འདི་ལ་བསྒོམ་ཞིང་བསྙེན་བཀུར་ཏོ། །
en: I honored those lords of munis And meditated on this liberation.

source: རྒྱལ་པོའི་གནས་རབ་ཡངས་ཤིང་བཟང་བྱུང་བ། །དེ་ཡི་མྱིང་ནི་དགའ་བས་བརྒྱན་པ་སྟེ། །
en: {14} “There was a vast, excellent royal capital, And its name was Rativyūhā.

source: དེ་ཚེ་སེམས་ཅན་རྣམ་པར་མ་དག་སེམས། །མྱི་བཟད་ངན་དུ་སྤྱོད་པ་དེར་བྱུང་གྱུར། །
en: At that time, the minds of beings were impure, And they had dreadfully bad conduct.

source: དེ་ནི་རྒྱལ་པོ་རྒྱལ་བའི་འོད་བྱུང་སྟེ། །སེམས་ཅན་དེ་དག་ཆོས་ཀྱིས་བསྐྱང་བ་བྱས། །
en: {15} “In that time, there was King Jayaprabha, Who governed those beings according to the Dharma.

source: དེ་ཡི་བུ་ནི་རྣམ་པར་རྒྱལ་བ་སྟེ། །མཛེས་ཤིང་མཚན་གྱིས་ཡན་ལག་བརྒྱན་པའོ། །
en: His son, named Vijitāvin, was handsome And adorned by the signs of a great being.

source: གཡོན་ལྡན་སྟོང་ཕྲག་མང་པོ་དེ་དག་ཀྱང་། །དེ་ཚེ་རྒྱལ་པོས་གསད་པར་བྱས་མཐོང་ནས། །གཞོན་ནུ་སྙིང་བརྩེ་མྱི་དགའས་ཀུན་ནས་འཁོར། །མྱུར་དུ་དགྱེ་བར་རྒྱལ་པོ་དེ་ལ་གསོལ། །
en: {16} “At that time, seeing that the king was executing Those many thousands of criminals, The prince was filled with compassion and sadness, And he quickly beseeched the king to release them.

source: རྒྱལ་པོས་ཐོས་ནས་དེ་ཚེ་བློན་པོ་རྣམས། །མ་ལུས་ཀུན་བསྡུས་དེ་ལ་བཀའ་སྩལ་ནས། །
en: {17} “When the king had heard him, he gathered together All his ministers and spoke to them.

source: ཀུན་གྱིས་དེ་ལ་ཕྱག་བྱས་ཕྱིར་གསོལ་པ། །དེ་ནི་རྒྱལ་པོ་ཁྱོད་དགྲོངས་ཐབས་གཅིག་ལགས། །
en: They all bowed down to him and said to him, ‘This is a plan to assassinate you, Your Majesty!’

source: རྒྱལ་པོ་དེ་ལྟར་ལོག་པར་ཐུགས་བཅུག་ནས། །སྲས་དེ་གསད་པར་དེ་ཚེ་བྱས་གྱུར་ཀྱང་། །
en: {18} “The king, having this misunderstanding, At that time ordered the execution of his son.

source: བདག་སྲོག་ཕངས་པར་མ་བརྩིས་ངོམ་ཟུང་མྱེད། །རྒྱལ་པོའི་སྲས་ཀྱིས་གསད་པར་བྱས་མ་བཏང་། །
en: The prince was indifferent to the loss of his own life, And he did not free himself from being executed.

source: གསད་པར་བྱས་པ་དེ་ཡི་མས་ཐོས་ནས། །རྒྱལ་པོ་དེ་ལ་འཁོར་བཅས་གསོལ་བ་འདེབས། །དགུང་ཟླ་ཕྱེད་ཅིག་སྦྱིན་པ་མ་ལུས་པར། །འཇིག་རྟེན་སྩོལ་དུ་གཞོན་ནུ་བཏང་བར་གནང་། །
en: {19} “When his mother heard that he was to be executed, With her entourage she supplicated the king, Asking for permission for the prince to give to the world All that he possessed for the duration of half a month.

source: རྒྱལ་པོ་དེས་ཀྱང་དེ་ལྟར་གནང་གྱུར་ནས། །དེས་ནི་ཅི་འདོད་སྦྱིན་པ་ཡོངས་སུ་བཏང་། །ཟླ་བ་ཕྱེད་དུ་ཉིན་མཚན་སྦྱིན་བྱས་གནས། །
en: {20} “The king gave his permission for that to be done, And the prince gave away whatever was wanted For half a month, day and night, practicing generosity.

source: ཉི་མའི་ཐ་མར་ཚོགས་པར་གྱུར་པ་ཡི། །ཞགས་པ་འཐུབ་པ་གང་རྣམས་ཅི་འདོད་པ། །དེ་ལ་དེ་བྱིན་འཆི་བར་སྟ་གོན་གནས། །
en: And on the last day, to a gathering of Jains {21} “He gave whatever they desired, And having given to them he prepared for death.

source: རྒྱལ་པོའི་གནས་དེར་འགྲོ་བ་མང་པོ་དག །ཆོ་ངེར་ངུ་ཞིང་ཀུན་ཀྱང་འདུས་པར་གྱུར། །
en: A multitude of beings wailing and weeping Gathered together at the royal capital.

source: བྱང་ཆུབ་ཤིང་དྲུང་བདེ་གཤེགས་དེ་ཡི་ཚེ། །དམ་ཆོས་དབྱངས་མཆོག་སྒྲོན་མའི་རྒྱལ་བཞུགས་པས། །
en: {22} “At that time, there sat at the foot of a Bodhi tree The Sugata Saddharma­ghoṣāmbara­dīpa­rāja.

source: འགྲོ་བའི་དབང་པོ་སྨྱིན་པར་ཐུགས་ཆུད་ནས། །མཆོད་སྦྱིན་ར་བར་ཐུགས་རྗེ་ཆེན་པོས་བྱོན། །
en: That lord of beings knew it was time to ripen them, And with great compassion he came to the place where gifts were given.

source: དེ་བཞིན་གཤེགས་པའི་རྣམ་འཕྲུལ་རྣམ་ཕྱེ་བས། །དེ་ཡི་འཁོར་དུ་བདེ་གཤེགས་བྱོན་གྱུར་ནས། །ཆོས་ཀྱི་སྒྲོན་མེའི་སྤྲིན་གྱི་སྒྲ་སྒྲོག་པའི། །མདོ་སྡེའི་རྒྱལ་པོ་བདེ་བར་གཤེགས་པས་བཤད། །
en: {23} “The Tathāgata came to that gathering Through his miraculous powers, And the Sugata taught the king of sūtras, The sound of the Dharma as a cloud of lamps of the Dharma.

source: འགྲོ་བ་མཐའ་དང་དབུས་མྱེད་རྣམ་བཏུལ་ནས། །དེ་ཚེ་བྱང་ཆུབ་མཆོག་ཏུ་ལུང་ཡང་བསྟན། །
en: {24} “He guided beings without end or middle And at that time gave prophecies of enlightenment.

source: རྒྱལ་པོའི་སྲས་པོ་རྣམ་པར་རྒྱལ་བ་ཡང་། །ཤིན་ཏུ་དགའ་བས་བྱང་ཆུབ་མཆོག་ཏུ་ཞུགས། །
en: The son of the king, Vijitāvin, was overjoyed And entered upon attaining the supreme enlightenment.

source: བདེ་གཤེགས་བསྙེན་བཀུར་མཆོད་པ་རྣམས་ཡངས་པས། །དེ་ལ་མཆོད་བྱས་དགའ་བར་སྨྲས་པ་ནི། །འགྲོ་བ་རྣམ་འདུལ་སྐྱབས་སུ་བདག་འགྱུར་གྱི། །མགོན་དང་གནས་དང་དཔུང་དུའང་དེ་བཞིན་ཞེས། །
en: {25} “He offered to the Sugata vast honors and offerings, And with joy he said these words: ‘May I become for beings a sanctuary, a guide, A protector, a refuge, and a defender.’

source: རྒྱལ་བ་དེ་ཡི་ཞམ་རིང་ཐར་བར་ཞུགས། །ཡང་དག་བྱང་ཆུབ་ལམ་ནི་ཡོངས་ཚོལ་ཞིང་། །
en: {26} “He became a mendicant under that muni And sought the path to enlightenment.

source: ཆོས་ཀྱི་རང་བཞིན་རབ་ཏུ་བརྟག་བྱ་བས། །དེར་གནས་བསྐལ་པ་བརྒྱ་ཕྲག་མང་དུ་སྤྱད། །
en: He examined the nature of phenomena, Remaining practicing in that way for a hundred kalpas.

source: སྡུག་བསྔལ་རྒྱ་མཚོར་ལྷུང་ཞིང་མདོངས་གྱུར་པའི། །འགྲོ་བ་མགོན་མྱེད་ཀུན་ལ་སྙིང་བརྩེ་བས། །ཡང་དག་བྱང་ཆུབ་ལམ་ལ་ཡོངས་བསྒོམས་ནས། །དེ་ཚེ་དེའི་རྣམ་ཐར་འདི་ཐོབ་བོ། །
en: {27} “He had compassion for beings with no protector Who were falling into an ocean of suffering, And, meditating on the path to true enlightenment, He attained at that time this liberation.

source: བསྐལ་པ་དེ་ལ་བདེ་གཤེགས་གང་བྱུང་བ། །དེ་དག་ཀུན་ལའང་དགའ་བས་བསྙེན་བཀུར་ནས། །དེ་དག་ཀུན་ལ་མཆོད་པ་ཆེན་པོ་བྱས། །ཆོས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་བཟུང་བར་གྱུར། །
en: {28} “He joyfully honored every one Of the sugatas who appeared in that kalpa, Making great offerings to all of them And possessing their wheels of the Dharma.

source: དེ་ཡི་འོག་ཏུ་བསྐལ་པ་རྒྱ་མཚོ་རྣམས། །ཞིང་མང་རྒྱ་མཚོ་རྡུལ་སྙེད་ཀུན་ལ་ཡང་། །རྒྱལ་བ་ཇི་སྙེད་སྐྱེས་པར་གྱུར་པ་དག །རབ་ཏུ་མཆོད་དེ་དེ་དག་བསྙེན་བཀུར་བྱས། །རྣམ་པར་རྒྱལ་ཞེས་བྱ་བ་ཁོ་མོ་ཡིན། །
en: {29} “After that, during an ocean of kalpas As numerous as the atoms in a sea of realms, He made offerings, and he honored However many jinas appeared.

source: ཉམ་ང་བཙོན་རར་གནས་པའི་བཙོན་མཐོང་ནས། །དེ་དག་དགྲོལ་ཕྱིར་ལུས་ཀྱང་ཡོངས་སུ་བཏང་། །རྣམ་ཐར་འདི་ཡང་དེ་ཚེ་ཐོབ་པར་གྱུར། །ཞིང་རྣམས་རྒྱ་མཚོའི་རྡུལ་ཕྲན་རབ་འགྲངས་པའི། །བསྐལ་པ་རྒྱ་མཚོ་མང་པོར་བསྒོམ་པར་བྱས། །ཚུལ་མང་མཐའ་དང་དབུས་མེད་མཉམ་མྱེད་པས། །
en: {30} “I was the one named Vijitāvin, Who saw the prisoners in the dreadful prison, Offered up his body in order to free them, And at that time attained this liberation, {31} “Who meditated during a great ocean of kalpas As numerous as the atoms in an ocean of realms, And who, in each instant, multiplied the ways That were unequaled and vast, without end or middle.

source: སྐད་ཅིག་རེ་རེ་དག་ཏུ་རྣམ་པར་སྤེལ། །ཐུབ་པའི་བདག་པོ་ཇི་སྙེད་མཐོང་གྱུར་པ། །དེ་དག་སྤྱན་སྔར་སྔན་ཆད་འདི་ཐོབ་སྟེ། །སྒོ་ཚུལ་རྣམ་པ་གཞན་དང་གཞན་དག་གིས། །དེ་དག་གིས་ནི་རྣམ་ཐར་འདི་ཡང་བསྟན། །
en: {32} “I have obtained this liberation From as many lords of munis as I saw; They taught me this liberation Through various ways of entry.

source: དེ་དག་རྣམ་ཐར་མ་ནོར་བསམ་ཡས་ལ། །བསྐལ་པ་བྱེ་བ་མང་པོར་ཁོ་མོས་བསླབས། །
en: {33} “I trained for many millions of kalpas In this unmistaken, inconceivable liberation I received from them.

source: དེ་ལ་རྒྱལ་བས་བཀོད་ཅིང་གྲོལ་གྱུར་པ། །
en: Established in it by the jinas, I was liberated.

source: དེ་དག་དམ་ཆོས་སྤྲིན་ལས་ཅིག་ཅར་འཐུང་། །
en: I simultaneously drank from their clouds of Dharma.

source: ཕྱོགས་བཅུ་ཀུན་གྱི་ཞིང་རྣམས་ཐམས་ཅད་དུ། །ཐོགས་པ་མེད་པར་ལུས་ཀྱིས་རྒྱས་པར་འགེངས། །
en: {34} “My bodies pervaded without impediment All the realms in all the ten directions.

source: སྐད་ཅིག་རེ་རེར་ཞིང་རྒྱུད་བསམ་ཡས་པའི། །དུས་གསུམ་རྒྱུད་རྣམས་ཀུན་ལའང་རབ་ཏུ་འཇུག །
en: In each instant, I entered countless realms And entered the divisions of the three times.

source: དུས་གསུམ་རྒྱལ་བ་རྒྱ་མཚོ་མ་ལུས་པ། །རེ་རེ་ཀུན་ལའང་མངོན་དུ་རབ་ཏུ་ལྟ། །
en: {35} “They gaze upon each and every one without exception In the ocean of the jinas in the three times.

source: དེ་དག་ལུས་ཀྱི་གཟུགས་བརྙན་རྒྱལ་བ་ལ། །སྤྲིན་ཏུ་གྱུར་པ་རྣམས་ཀྱང་སྤྱན་སྔར་འགྲིམ། །
en: They wander in the presence of the clouds Of the visual images of their bodies.
